app/Filters/RecordVisitor.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('visitors');

        // Data pengunjung
        $ipAddress = $request->getIPAddress();
        $userAgent = $_SERVER['HTTP_USER_AGENT'] ?? 'Unknown';


        // Periksa apakah kunjungan telah tercatat dalam 30 menit terakhir
        $timeLimit = date('Y-m-d H:i:s', strtotime('-30 minutes'));
        $existingVisit = $builder->where('ip_address', $ipAddress)
                                 ->where('user_agent', $userAgent)
                                 ->where('visited_at >=', $timeLimit)
                                 ->get()
                                 ->getRow();

        if (!$existingVisit) {
            // Simpan data kunjungan baru
            $builder->insert([
                'ip_address' => $ipAddress,
                'user_agent' => $userAgent,
            ]);
---
SELECT *
FROM `visitors`
WHERE `ip_address` = '::1'
AND `user_agent` = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36'
AND `visited_at` >= '2025-01-15 14:21:02'
INSERT INTO `visitors` (`ip_address`, `user_agent`) VALUES ('::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36')