app/Controllers/AdminManagementController.php

DELETE FROM `admin`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $adminModel = new AdminModel();

        // Menghapus data
        $isDeleted = $adminModel->delete($id);