app/Controllers/AdminContentController.php

        public function pengaturan() {
        // Periksa apakah pengguna sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
        }
        $adminModel = new AdminModel();
        $konsultanModel = new KonsultanModel();
        $data['admins'] = $adminModel->findAll();
---
SELECT *
FROM `admin`