app/Controllers/Admin.php

    public function pengaturan() {
    // Periksa apakah pengguna sudah login
    if (!session()->get('logged_in')) {
        return redirect()->to('/staff')->with('error', 'Silakan login terlebih dahulu!');
    }
    $adminModel = new AdminModel();
    $konsultanModel = new KonsultanModel();
    $data['admins'] = $adminModel->findAll();
    $data['konsultans'] = $konsultanModel->findAll();
---
SELECT *
FROM `admin`
SELECT *
FROM `konsultan`