app/Controllers/AdminContentController.php

SELECT *
FROM `konsultasi`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `konsultasi`
---
        public function index(): string
        {
            // Periksa apakah pengguna sudah login
            if (!session()->get('logged_in')) {
                return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
            }

            $konsultasiModel = new KonsultasiModel();

            $data['requests'] = $konsultasiModel->paginate(10);

SELECT *
FROM `konsultasi`
WHERE `status_konsultasi` = 'Disetujui'
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `konsultasi`
WHERE `status_konsultasi` = 'Disetujui'
---
        public function filterDashboard()
        {
            // Periksa apakah pengguna sudah login
            if (!session()->get('logged_in')) {
                return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
            }

            $status = $this->request->getPost('status');

            // Load model
            $konsultasiModel = new KonsultasiModel();

            // Buat query dengan kondisi filter
            if ($status) {
                $requests = $konsultasiModel->where('status_konsultasi', $status)->paginate(4);

SELECT *
FROM `konsultasi`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `konsultasi`
---
                $konsultasiModel->where('tanggal_reservasi >=', $date);
            }

            $data['requests'] = $konsultasiModel->paginate(10); // Data dengan pagination