app/Controllers/AuthController.php

SELECT *
FROM `admin`
WHERE `username` = 'rifky'
 LIMIT 1
---
    public function loginSubmit()
    {
        $adminModel = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari data admin berdasarkan username
        $admin = $adminModel->where('username', $username)->first();