app/Controllers/JadwalKonsultasiController.php

SELECT *
FROM `konsultasi`
WHERE `konsultasi`.`id` = '1'
SELECT *
FROM `konsultan`
---
    public function index($id)
    {
        helper('form');

        if (!session()->get('logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
        }

        $data['konsultasi'] = $this->konsultasiModel->find($id);
        $data['konsultan'] = $this->konsultanModel->findAll();

UPDATE `konsultasi` SET `jadwal_konsultasi` = '2024-12-12 07:00:00', `link_zoom` = 'asdasd', `konsultan_id` = '1', `status_konsultasi` = 'Disetujui'
WHERE `konsultasi`.`id` IN ('10')
---
            $konsultasi_id = $this->request->getPost('konsultasi_id');

            // Update data konsultasi
            $this->konsultasiModel->update($konsultasi_id, $data);

SELECT *
FROM `konsultasi`
WHERE `konsultasi`.`id` = '1'
SELECT *
FROM `konsultan`
WHERE `konsultan`.`id` = '2'
SELECT *
FROM `konsultasi`
WHERE `konsultasi`.`id` = '3'
---
    public function notification($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
        }

        if ($id === null) {
            $id = $this->request->getPost('konsultasi_id');
        }

        // Ambil data konsultasi
        $data['konsultasi'] = $this->konsultasiModel->find($id);

        // Cek apakah data konsultasi ditemukan
        if (!$data['konsultasi']) {
            return redirect()->to('/admin/dashboard')->with('error', 'Data konsultasi tidak ditemukan.');
        }

        // Setelah memastikan data konsultasi ada, baru ambil data konsultan
        $data['konsultan'] = $this->konsultanModel->find($data['konsultasi']['konsultan_id']);

SELECT *
FROM `konsultasi`
WHERE `konsultasi`.`id` = '2'
SELECT *
FROM `konsultan`
WHERE `konsultan`.`id` = '4'
---
    public function sendNotification($id)
    {
        // Check admin authentication
        if (!session()->get('logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
        }

        // Retrieve consultation and consultant data
        $konsultasi = $this->konsultasiModel->find($id);
        $konsultan = $this->konsultanModel->find($konsultasi['konsultan_id']);