app/Controllers/KonsultasiController.php

    public function checkStatus()
    {
        // Load model
        $konsultasiModel = new \App\Models\KonsultasiModel();

        // Ambil token dari input form
        $token = $this->request->getPost('token');

        // Cari data reservasi berdasarkan token
        $reservation = $konsultasiModel->where('token_konsultasi', $token)->first();
---
SELECT *
FROM `konsultasi`
WHERE `token_konsultasi` = 'PST675FE26151012'
 LIMIT 1

    public function detail($id)
    {
        // Periksa apakah pengguna sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu!');
        }
        $konsultasiModel = new KonsultasiModel();
        $data['konsultasi'] = $konsultasiModel->find($id);
---
SELECT *
FROM `konsultasi`
WHERE `konsultasi`.`id` = '18'