app/Controllers/KonsultanManagementController.php

INSERT INTO `konsultan` (`nama`, `email`, `whatsapp`) VALUES ('konsultan2', '222212836@stis.ac.id', '083890059615')
---
    public function store()
    {
        $konsultanModel = new KonsultanModel();

        // Validasi input
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'nama' => 'required|max_length[100]',
            'email' => 'required|valid_email|max_length[50]',
            'whatsapp' => 'required|max_length[20]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // Simpan data konsultan baru
        $konsultanModel->save([
            'nama' => $this->request->getPost('nama'),
            'email' => $this->request->getPost('email'),
            'whatsapp' => $this->request->getPost('whatsapp')
        ]);